[Run]
  ;0简体1繁体
  language=0
  ;游戏数据语言编码0为GB，1为big5
  datacode=3
  checkupdate=0
  IniVersion=1052
firstrun=0
gamepath=D:\_sty\_bak\kys-all\水浒\develop\game\
topcolumn=0
leftcolumn=0
talkcode=3
talkinvert=0

[File]
  ;256调色板
  Palette=resource\mmap.col

  ;可以查看的主要贴图文件
  FileNumber=4
  File0=resource\hdgrp.idx,resource\hdgrp.grp,头像贴图
  Section0=
  File1=resource\mmap.idx,resource\mmap.grp,主地图贴图
  Section1=地面,0,701,表面,701,1001,建筑,1001,1501,人物,2501,2553,物品,3501,3701
  File2=resource\sdx,resource\smp,场景贴图
  Section2= 
  File3=resource\wdx,resource\wmp,战斗贴图
  Section3=
 
  FightNum=200
  ;战斗贴图 
  FightName=fight\fdx***,fight\fmp***,战斗贴图
  
  ;进度文件(对话事件战斗等编辑器缺省读取的进度文件)
  RIDX=save\ranger.idx,save\ranger.idx,save\ranger.idx,save\ranger.idx,save\ranger.idx,save\ranger.idx,save\Ranger.idx
  RGRP=save\Ranger.grp,save\R1.grp,save\R2.grp,save\R3.grp,save\R4.grp,save\R5.grp,save\R6.grp
  SIDX=save\allsin.idx,save\allsin.idx,save\allsin.idx,save\allsin.idx,save\allsin.idx,save\allsin.idx
  SGRP=save\allsin.grp,save\S1.grp,save\S2.grp,save\S3.grp,save\S4.grp,save\S5.grp,save\S6.grp
  DIDX=save\alldef.idx,save\alldef.idx,save\alldef.idx,save\alldef.idx,save\alldef.idx,save\alldef.idx
  DGRP=save\alldef.grp,save\D1.grp,save\D2.grp,save\D3.grp,save\D4.grp,save\D5.grp,save\D6.grp  
  RecordNote=新游戏进度,进度一,进度二,进度三,进度四,进度五,自动挡

  ;对话文件
  TalkIDX=resource\talk.idx
  TalkGRP=resource\talk.grp
  ;战斗定义文件
  WarDefine =resource\War.sta

 ;战斗地图结构文件
  WarMAPDefIDX=resource\warfld.idx
  WarMAPDefGRP=resource\warfld.grp
  ; 应写上合并后的文件名，如wdx/wmp。
  WarMapIDX=resource\wdx
  WarMapGRP=resource\wmp 

  ; 场景地图合并后的文件名，如sdx/smp。
    SMAPIDX=resource\sdx
    SMAPGRP=resource\smp 

  
  ; 事件文件
  KdefIDx=resource\Kdef.idx
  KdefGRP=resource\Kdef.grp 

     ; 主地图
    MMAPIDX =resource\mmap.idx
    MMAPGRP =resource\mmap.grp

    ; 主地图结构    
    MMAPStruct =resource\earth.002,resource\Surface.002,resource\Building4.002,resource\Buildx.002,resource\Buildy.002

    ;复刻专有文件
    Leave=list\leave.bin
    Effect=list\effect.bin
    Match=list\Match.bin 
    Exp=list\levelup.bin
SMAPIMZ =resource\smap.imz
    SMAPPNGPATH = resource\smap\
SceneMode=1
WarMode=0

[R_Modify]
    ; 修改R*数据
; 6 种数据
    TypeNumber = 6 
    
    TypeName0 =基本数据
    TypeDataItem0 =15
    ; 数组个数，数组结构成员个数，字节数，是否字串，是否名称，引用数据类型,名字，说明
    ; 间隔使用空格，一定要注意字符串中间不能有空格，而且空格只能有一个，等号后面不能有空格。
    Data(0,0) =1 1 4 0 0 -1 乘船 0主角不乘船/1主角乘船 
    data(0,1) =1 1 4 0 0 -1 无用 无用 
    data(0,2) =1 1 4 0 0 -1 人X 大地图人横坐标X(0-479) 
    data(0,3) =1 1 4 0 0 -1 人Y 大地图人纵坐标X(0-479) 
    data(0,4) =1 1 4 0 0 -1 人X1坐标 进入场景的横坐标X(0-63)，不用修改，进入场景自动变化 
    data(0,5) =1 1 4 0 0 -1 人Y1坐标 进入场景的纵坐标X(0-63)，不用修改，进入场景自动变化 
    data(0,6) =1 1 4 0 0 -1 人面对方向 0上1右2左3下,0
    data(0,7) =1 1 4 0 0 -1 船X 船X 
    data(0,8) =1 1 4 0 0 -1 船Y 船Y
    data(0,9) =1 1 4 0 0 -1 所在场景 所在场景
    data(0,10) =1 1 4 0 0 -1 船Y1 船Y1
    data(0,11) =1 1 4 0 0 -1 船面对方向 0上1右2左3下
    data(0,12) =6 1 4 0 0 1 队友 队友(-1表示为空)，第一个必须是主角，不能修改
    data(0,13) =304 2 4 0 0 2 物品 物品(-1表示为空)
    data(0,14) =0 1 4 0 0 -1 物品个数 物品个数
    
    TypeName1 =人物
    TypedataItem1 = 90
    
    data(1,0) = 1 1 4 0 0 -1 代号 人物代号，仅作为标志，游戏不使用
    data(1,1) = 1 1 4 0 0 -1 头像 人物头像代号
    data(1,2) = 1 1 4 0 0 -1 生命增长 升级时生命增长幅度，每升一级生命最大值增长：3*生命增长+(0-6)随机
    data(1,3) = 1 1 4 0 0 -1 战斗图 战斗图
    data(1,4) = 1 1 20 1 1 -1 姓名 姓名，最多4个汉字
    data(1,5) = 1 1 4 0 0 -1 攻击增长 增长，最多5个汉字
    data(1,6) = 1 1 4 0 0 -1 轻功增长 增长，最多5个汉字
    data(1,7) = 1 1 4 0 0 -1 防御增长 增长，最多5个汉字
    data(1,8) = 1 1 4 0 0 -1 内力增长 增长，最多5个汉字
    data(1,9) = 1 1 4 0 0 -1 自动升级 增长，最多5个汉字
    data(1,10) = 1 1 4 0 0 -1 性别 性别，0男1女2太监
    data(1,11) = 1 1 4 0 0 -1 等级 等级，最多30级
    data(1,12) = 1 1 4 0 0 -1 经验值 经验值，最高60000
    data(1,13) = 1 1 4 0 0 -1 生命 生命值，最高999
    data(1,14) = 1 1 4 0 0 -1 生命最大值 生命最大值，最高999
    data(1,15) = 1 1 4 0 0 -1 受伤程度 受伤程度，最高100。过重影响医疗，不能住宿恢复生命等。医疗/吃药可减少
    data(1,16) = 1 1 4 0 0 -1 中毒程度 中毒程度，中毒后战斗每回合减少生命，中毒越深减少越多。
    data(1,17) = 1 1 4 0 0 -1 体力 体力，最大100
    data(1,18) = 1 1 4 0 0 -1 物品修炼点数 物品修炼点数，修炼能练出物品的秘笈时使用
    data(1,19) = 1 1 4 0 0 2 武器 武器物品代号
    data(1,20) = 1 1 4 0 0 2 防具 防具物品代号
    data(1,21) = 1 1 4 0 0 -1 被动技能 被动技能
    data(1,22) = 1 1 4 0 0 -1 出招动画帧数 fight***中每方向动画帧数，2拳
    data(1,23) = 1 1 4 0 0 -1 出招动画帧数 fight***中每方向动画帧数，3剑
    data(1,24) = 1 1 4 0 0 -1 出招动画帧数 fight***中每方向动画帧数，4刀
    data(1,25) = 1 1 4 0 0 -1 出招动画帧数 fight***中每方向动画帧数，5特殊
    data(1,26) = 1 1 4 0 0 -1 出招动画延迟 1医疗/用毒/解毒出招动画延迟帧数，出招动画开始到此延迟帧数后才显示武功效果
    data(1,27) = 1 1 4 0 0 -1 出招动画延迟 2拳出招动画延迟帧数，出招动画开始到此延迟帧数后才显示武功效果
    data(1,28) = 1 1 4 0 0 -1 出招动画延迟 3剑出招动画延迟帧数，出招动画开始到此延迟帧数后才显示武功效果
    data(1,29) = 1 1 4 0 0 -1 出招动画延迟 4刀出招动画延迟帧数，出招动画开始到此延迟帧数后才显示武功效果
    data(1,30) = 1 1 4 0 0 -1 出招动画延迟 5特殊出招动画延迟帧数，出招动画开始到此延迟帧数后才显示武功效果
    data(1,31) = 1 1 4 0 0 -1 武功音效延迟 相应的武功音效延迟帧数，出招动画开始到此延迟帧数后才播放武功音效
    data(1,32) = 1 1 4 0 0 -1 武功音效延迟 相应的武功音效延迟帧数，出招动画开始到此延迟帧数后才播放武功音效
    data(1,33) = 1 1 4 0 0 -1 武功音效延迟 相应的武功音效延迟帧数，出招动画开始到此延迟帧数后才播放武功音效
    data(1,34) = 1 1 4 0 0 -1 武功音效延迟 相应的武功音效延迟帧数，出招动画开始到此延迟帧数后才播放武功音效
    data(1,35) = 1 1 4 0 0 -1 武功音效延迟 相应的武功音效延迟帧数，出招动画开始到此延迟帧数后才播放武功音效
    data(1,36) = 1 1 4 0 0 -1 内力性质 内力性质，0阴性、1阳性、2阴阳调和
    data(1,37) = 1 1 4 0 0 -1 内力 内力，最大999
    data(1,38) = 1 1 4 0 0 -1 内力最大值 内力最大值，最大999
    data(1,39) = 1 1 4 0 0 -1 攻击力 攻击力，最大100
    data(1,40) = 1 1 4 0 0 -1 轻功 轻功，最大100
    data(1,41) = 1 1 4 0 0 -1 防御力 防御力，最大100
    data(1,42) = 1 1 4 0 0 -1 医疗 医疗，最大100
    data(1,43) = 1 1 4 0 0 -1 用毒 用毒，最大100
    data(1,44) = 1 1 4 0 0 -1 解毒 解毒，最大100
    data(1,45) = 1 1 4 0 0 -1 抗毒 抗毒，最大100
    data(1,46) = 1 1 4 0 0 -1 拳掌 拳掌，最大100
    data(1,47) = 1 1 4 0 0 -1 御剑 御剑，最大100
    data(1,48) = 1 1 4 0 0 -1 耍刀 耍刀，最大100
    data(1,49) = 1 1 4 0 0 -1 特殊兵器 特殊兵器，最大100
    data(1,50) = 1 1 4 0 0 -1 暗器技巧 暗器技巧，最大100
    data(1,51) = 1 1 4 0 0 -1 武学常识 武学常识，最大100
    data(1,52) = 1 1 4 0 0 -1 品德 品德，最大100
    data(1,53) = 1 1 4 0 0 -1 攻击带毒 攻击带毒，最大100
    data(1,54) = 1 1 4 0 0 -1 移动数 移动格数，除以10为移动数
    data(1,55) = 1 1 4 0 0 -1 声望 个人声望
    data(1,56) = 1 1 4 0 0 -1 资质 资质，资质越高修炼所需经验越少
    data(1,57) = 1 1 4 0 0 2 修练物品 当前修练物品代号
    data(1,58) = 1 1 4 0 0 -1 修炼点数 修炼点数，当前修炼点数
    data(1,59) = 1 1 4 0 0 4 所会武功1 所会武功1代号，0表示没有武功
    data(1,60) = 1 1 4 0 0 4 所会武功2 所会武功2代号，0表示没有武功
    data(1,61) = 1 1 4 0 0 4 所会武功3 所会武功3代号，0表示没有武功
    data(1,62) = 1 1 4 0 0 4 所会武功4 所会武功4代号，0表示没有武功
    data(1,63) = 1 1 4 0 0 4 所会武功5 所会武功5代号，0表示没有武功
    data(1,64) = 1 1 4 0 0 4 所会武功6 所会武功6代号，0表示没有武功
    data(1,65) = 1 1 4 0 0 4 所会武功7 所会武功7代号，0表示没有武功
    data(1,66) = 1 1 4 0 0 4 所会武功8 所会武功8代号，0表示没有武功
    data(1,67) = 1 1 4 0 0 4 所会武功9 所会武功9代号，0表示没有武功
    data(1,68) = 1 1 4 0 0 4 所会武功10 所会武10功代号，0表示没有武功
    data(1,69) = 1 1 4 0 0 -1 所会武功1等级 所会武功1等级，100分一级，900点十级
    data(1,70) = 1 1 4 0 0 -1 所会武功2等级 所会武功2等级，100分一级，900点十级
    data(1,71) = 1 1 4 0 0 -1 所会武功3等级 所会武功3等级，100分一级，900点十级
    data(1,72) = 1 1 4 0 0 -1 所会武功4等级 所会武功4等级，100分一级，900点十级
    data(1,73) = 1 1 4 0 0 -1 所会武功5等级 所会武功5等级，100分一级，900点十级
    data(1,74) = 1 1 4 0 0 -1 所会武功6等级 所会武功6等级，100分一级，900点十级
    data(1,75) = 1 1 4 0 0 -1 所会武功7等级 所会武功7等级，100分一级，900点十级
    data(1,76) = 1 1 4 0 0 -1 所会武功8等级 所会武功8等级，100分一级，900点十级
    data(1,77) = 1 1 4 0 0 -1 所会武功9等级 所会武功9等级，100分一级，900点十级
    data(1,78) = 1 1 4 0 0 -1 所会武功10等级 所会武功10等级，100分一级，900点十级
    data(1,79) = 1 1 4 0 0 2 携带物品1 携带物品1代号
    data(1,80) = 1 1 4 0 0 2 携带物品2 携带物品2代号
    data(1,81) = 1 1 4 0 0 2 携带物品3 携带物品3代号
    data(1,82) = 1 1 4 0 0 2 携带物品4 携带物品4代号
    data(1,83) = 1 1 4 0 0 -1 携带物品1数量 携带物品1数量
    data(1,84) = 1 1 4 0 0 -1 携带物品2数量 携带物品2数量
    data(1,85) = 1 1 4 0 0 -1 携带物品3数量 携带物品3数量
    data(1,86) = 1 1 4 0 0 -1 携带物品4数量 携带物品4数量
    data(1,87) = 1 1 4 0 0 -1 两次攻击否 1为2次攻击，0为否
    data(1,88) = 4 1 4 0 0 4 内功 内功
    data(1,89) = 4 1 4 0 0 -1 等级 等级

    TypeName2 =物品
    TypedataItem2 = 65
    
    data(2,0) = 1 1 4 0 0 -1 代号 代号
    data(2,1) = 8 1 4 0 0 -1 物品名 物品名，似乎无用
    data(2,2) = 1 1 4 0 0 -1 锻造次数 物品名，似乎无用
    data(2,3) = 1 1 4 0 0 -1 价格 物品名，似乎无用
    data(2,4) = 1 1 40 1 1 -1 物品名 物品名
    data(2,5) = 1 1 60 1 0 -1 物品说明 物品说明
    data(2,6) = 1 1 4 0 0 4 练出武功 练出武功，-1表示没有
    data(2,7) = 1 1 4 0 0 -1 暗器动画编号 暗器动画编号，eft中的动画编号(0-52)，-1表示没有
    data(2,8) = 1 1 4 0 0 1 使用人 当前使用物品的人，-1表示没有
    data(2,9) = 1 1 4 0 0 -1 装备类型 0武器1防具，-1表示不属于装备类型
    data(2,10) = 1 1 4 0 0 -1 显示物品说明 0不显示，1显示
    data(2,11) = 1 1 4 0 0 -1 类型 物品类型，0剧情，1装备，2秘笈，3药品，4暗器
    data(2,12) = 1 1 4 0 0 -1 未知5 无用
    data(2,13) = 1 1 4 0 0 -1 未知6 无用
    data(2,14) = 1 1 4 0 0 -1 未知7 无用
    data(2,15) = 1 1 4 0 0 -1 加生命 加生命，药品加生命，暗器减生命，适用物品类型：药品，暗器
    data(2,16) = 1 1 4 0 0 -1 加生命最大值 加生命最大值，适用物品类型：药品，秘笈
    data(2,17) = 1 1 4 0 0 -1 加中毒解毒 +中毒-解毒，适用物品类型：药品
    data(2,18) = 1 1 4 0 0 -1 加体力 加体力，适用物品类型：药品
    data(2,19) = 1 1 4 0 0 -1 改变内力性质 改变内力性质，设为2则内力改为阴阳调和。适用物品类型：药品、秘笈
    data(2,20) = 1 1 4 0 0 -1 加内力 加内力，适用物品类型：药品
    data(2,21) = 1 1 4 0 0 -1 加内力最大值 加内力最大值，适用物品类型：药品
    data(2,22) = 1 1 4 0 0 -1 加攻击力 加攻击力，适用物品类型：药品、秘笈
    data(2,23) = 1 1 4 0 0 -1 加轻功 加轻功，适用物品类型：药品、秘笈
    data(2,24) = 1 1 4 0 0 -1 加防御力 加防御力，适用物品类型：药品、秘笈
    data(2,25) = 1 1 4 0 0 -1 加医疗 加医疗，适用物品类型：药品、秘笈
    data(2,26) = 1 1 4 0 0 -1 加使毒 加使毒，适用物品类型：药品、秘笈
    data(2,27) = 1 1 4 0 0 -1 加解毒 加解毒，适用物品类型：药品、秘笈
    data(2,28) = 1 1 4 0 0 -1 加抗毒 加抗毒，适用物品类型：药品、秘笈
    data(2,29) = 1 1 4 0 0 -1 加拳掌 加拳掌，适用物品类型：药品、秘笈
    data(2,30) = 1 1 4 0 0 -1 加御剑 加御剑，适用物品类型：药品、秘笈
    data(2,31) = 1 1 4 0 0 -1 加耍刀 加耍刀，适用物品类型：药品、秘笈
    data(2,32) = 1 1 4 0 0 -1 加特殊兵器 加特殊兵器，适用物品类型：药品、秘笈
    data(2,33) = 1 1 4 0 0 -1 加暗器技巧 加暗器技巧，适用物品类型：药品、秘笈
    data(2,34) = 1 1 4 0 0 -1 加武学常识 加武学常识，适用物品类型：药品、秘笈
    data(2,35) = 1 1 4 0 0 -1 加品德 适用物品类型：秘笈
    data(2,36) = 1 1 4 0 0 -1 加移动数 加移动数，加移动格数
    data(2,37) = 1 1 4 0 0 -1 加功夫带毒 加功夫带毒，适用物品类型：药品、秘笈
    data(2,38) = 1 1 4 0 0 1 仅修炼人物 仅修炼人物
    data(2,39) = 1 1 4 0 0 -1 需内力性质 需内力性质，适用物品类型：装备、秘笈
    data(2,40) = 1 1 4 0 0 -1 需内力 需内力，适用物品类型：装备、秘笈
    data(2,41) = 1 1 4 0 0 -1 需攻击力 需攻击力，适用物品类型：装备、秘笈
    data(2,42) = 1 1 4 0 0 -1 需轻功 需轻功，适用物品类型：装备、秘笈
    data(2,43) = 1 1 4 0 0 -1 需用毒 需用毒，适用物品类型：装备、秘笈
    data(2,44) = 1 1 4 0 0 -1 需医疗 需医疗，适用物品类型：装备、秘笈
    data(2,45) = 1 1 4 0 0 -1 需解毒 需解毒，适用物品类型：装备、秘笈
    data(2,46) = 1 1 4 0 0 -1 需拳掌 需拳掌，适用物品类型：装备、秘笈
    data(2,47) = 1 1 4 0 0 -1 需御剑 需御剑，适用物品类型：装备、秘笈
    data(2,48) = 1 1 4 0 0 -1 需耍刀 需耍刀，适用物品类型：装备、秘笈
    data(2,49) = 1 1 4 0 0 -1 需特殊兵器 需特殊兵器，适用物品类型：装备、秘笈
    data(2,50) = 1 1 4 0 0 -1 需暗器 需暗器，适用物品类型：装备、秘笈
    data(2,51) = 1 1 4 0 0 -1 需资质 需资质，适用物品类型：装备、秘笈
    data(2,52) = 1 1 4 0 0 -1 需经验 练成秘笈需要经验，适用物品类型：秘笈
    data(2,53) = 1 1 4 0 0 -1 练出物品需经验 练出物品需经验，适用物品类型：秘笈
    data(2,54) = 1 1 4 0 0 2 需材料 需材料
    data(2,55) = 1 1 4 0 0 2 练出物品1 练出物品1
    data(2,56) = 1 1 4 0 0 2 练出物品2 练出物品2
    data(2,57) = 1 1 4 0 0 2 练出物品3 练出物品3
    data(2,58) = 1 1 4 0 0 2 练出物品4 练出物品4
    data(2,59) = 1 1 4 0 0 2 练出物品5 练出物品5
    data(2,60) = 1 1 4 0 0 -1 需要物品1数量 需要物品1数量
    data(2,61) = 1 1 4 0 0 -1 需要物品2数量 需要物品2数量
    data(2,62) = 1 1 4 0 0 -1 需要物品3数量 需要物品3数量
    data(2,63) = 1 1 4 0 0 -1 需要物品4数量 需要物品4数量
    data(2,64) = 1 1 4 0 0 -1 需要物品5数量 需要物品5数量


    TypeName3 =场景
    TypedataItem3 = 22
    
    data(3,0) = 1 1 4 0 0 -1 代号 代号
    data(3,1) = 1 1 20 1 1 -1 名称 名称
    data(3,2) = 1 1 4 0 0 -1 出门音乐 出门音乐
    data(3,3) = 1 1 4 0 0 -1 进门音乐 进门音乐
    data(3,4) = 1 1 4 0 0 3 跳转场景 跳转到其它场景，-1表示没有。从一个场景跳转到另一个场景时用。
    data(3,5) = 1 1 4 0 0 -1 进入条件 进入条件，0开放，1关闭，2队伍中轻功大于70才能进入
    data(3,6) = 1 1 4 0 0 -1 外景入口X1 外景入口X1，如果不在外景有入口则设为0
    data(3,7) = 1 1 4 0 0 -1 外景入口Y1 外景入口Y2，如果不在外景有入口则设为0
    data(3,8) = 1 1 4 0 0 -1 外景入口X2 外景入口X2，如果不在外景有入口则设为0
    data(3,9) = 1 1 4 0 0 -1 外景入口Y2 外景入口Y2，如果不在外景有入口则设为0
    data(3,10) = 1 1 4 0 0 -1 入口X 入口X，进入场景主角初始坐标
    data(3,11) = 1 1 4 0 0 -1 入口Y 入口Y，进入场景主角初始坐标
    data(3,12) = 1 1 4 0 0 -1 出口X1 出口X1，场景出口坐标
    data(3,13) = 1 1 4 0 0 -1 出口X2 出口X2，场景出口坐标
    data(3,14) = 1 1 4 0 0 -1 出口X3 出口X3，场景出口坐标
    data(3,15) = 1 1 4 0 0 -1 出口Y1 出口Y1，场景出口坐标
    data(3,16) = 1 1 4 0 0 -1 出口Y2 出口Y2，场景出口坐标
    data(3,17) = 1 1 4 0 0 -1 出口Y3 出口Y3，场景出口坐标
    data(3,18) = 1 1 4 0 0 -1 跳转口X1 跳转口X1，X1跳转到其它场景入口坐标，X2从其它场景回来的坐标
    data(3,19) = 1 1 4 0 0 -1 跳转口Y1 跳转口Y2，Y1跳转到其它场景入口坐标，Y2从其它场景回来的坐标
    data(3,20) = 1 1 4 0 0 -1 跳转口X2 跳转口X2，X1跳转到其它场景入口坐标，X2从其它场景回来的坐标
    data(3,21) = 1 1 4 0 0 -1 跳转口Y2 跳转口Y2，Y1跳转到其它场景入口坐标，Y2从其它场景回来的坐标
    

    TypeName4 =武功
    TypedataItem4 = 65
    
    data(4,0) = 1 1 4 0 0 -1 代号 代号
    data(4,1) = 1 1 20 1 0 -1 名称 名称
    data(4,2) = 1 1 4 0 0 -1 减生命 血刀为-10，有吸血效果
    data(4,3) = 1 1 4 0 0 -1 最短攻击范围 无用
    data(4,4) = 1 1 4 0 0 -1 需要物品 无用
    data(4,5) = 1 1 4 0 0 -1 需要物品数 无用
    data(4,6) = 1 1 4 0 0 -1 特技脚本号 无用
    data(4,7) = 1 1 4 0 0 -1 出招音效 出招音效，atk***.wav
    data(4,8) = 1 1 4 0 0 -1 武功类型 1拳2剑3刀4特殊
    data(4,9) = 1 1 4 0 0 -1 武功动画&音效 武功动画&音效，eft中的动画，音效为e**.wav
    data(4,10) = 1 1 4 0 0 -1 伤害类型 0杀伤生命1杀伤内力
    data(4,11) = 1 1 4 0 0 -1 攻击范围 0点1线2十字3面
    data(4,12) = 1 1 4 0 0 -1 消耗内力点数 消耗内力点数
    data(4,13) = 1 1 4 0 0 -1 敌人中毒点数 敌人中毒点数
    data(4,14) = 1 1 4 0 0 -1 1级攻击力 1级别攻击力
    data(4,15) = 1 1 4 0 0 -1 10级攻击力 10级别攻击力
    data(4,16) = 1 1 4 0 0 -1 内力因子 内力对伤害的影响
    data(4,17) = 1 1 4 0 0 -1 轻功因子 轻功对伤害的影响
    data(4,18) = 1 1 4 0 0 -1 5级攻击力 5级别攻击力
    data(4,19) = 1 1 4 0 0 -1 6级攻击力 6级别攻击力
    data(4,20) = 1 1 4 0 0 -1 7级攻击力 7级别攻击力
    data(4,21) = 1 1 4 0 0 -1 8级攻击力 8级别攻击力
    data(4,22) = 1 1 4 0 0 -1 9级攻击力 9级别攻击力
    data(4,23) = 1 1 4 0 0 -1 10级攻击力 10级别攻击力
    data(4,24) = 1 1 4 0 0 -1 1级移动范围 1级移动范围
    data(4,25) = 1 1 4 0 0 -1 2级移动范围 2级移动范围
    data(4,26) = 1 1 4 0 0 -1 3级移动范围 3级移动范围
    data(4,27) = 1 1 4 0 0 -1 4级移动范围 4级移动范围
    data(4,28) = 1 1 4 0 0 -1 5级移动范围 5级移动范围
    data(4,29) = 1 1 4 0 0 -1 6级移动范围 6级移动范围
    data(4,30) = 1 1 4 0 0 -1 7级移动范围 7级移动范围
    data(4,31) = 1 1 4 0 0 -1 8级移动范围 8级移动范围
    data(4,32) = 1 1 4 0 0 -1 9级移动范围 9级移动范围
    data(4,33) = 1 1 4 0 0 -1 10级移动范围 10级移动范围
    data(4,34) = 1 1 4 0 0 -1 1级杀伤范围 1级杀伤范围
    data(4,35) = 1 1 4 0 0 -1 2级杀伤范围 2级杀伤范围
    data(4,36) = 1 1 4 0 0 -1 3级杀伤范围 3级杀伤范围
    data(4,37) = 1 1 4 0 0 -1 4级杀伤范围 4级杀伤范围
    data(4,38) = 1 1 4 0 0 -1 5级杀伤范围 5级杀伤范围
    data(4,39) = 1 1 4 0 0 -1 6级杀伤范围 6级杀伤范围
    data(4,40) = 1 1 4 0 0 -1 7级杀伤范围 7级杀伤范围
    data(4,41) = 1 1 4 0 0 -1 8级杀伤范围 8级杀伤范围
    data(4,42) = 1 1 4 0 0 -1 9级杀伤范围 9级杀伤范围
    data(4,43) = 1 1 4 0 0 -1 10级杀伤范围 10级杀伤范围
    data(4,44) = 1 1 4 0 0 -1 1级加内力 1级加内力
    data(4,45) = 1 1 4 0 0 -1 2级加内力 2级加内力
    data(4,46) = 1 1 4 0 0 -1 3级加内力 3级加内力
    data(4,47) = 1 1 4 0 0 -1 4级加内力 4级加内力
    data(4,48) = 1 1 4 0 0 -1 5级加内力 5级加内力
    data(4,49) = 1 1 4 0 0 -1 6级加内力 6级加内力
    data(4,50) = 1 1 4 0 0 -1 7级加内力 7级加内力
    data(4,51) = 1 1 4 0 0 -1 8级加内力 8级加内力
    data(4,52) = 1 1 4 0 0 -1 9级加内力 9级加内力
    data(4,53) = 1 1 4 0 0 -1 10级加内力 10级加内力
    data(4,54) = 1 1 4 0 0 -1 1级杀伤内力 1级杀伤内力
    data(4,55) = 1 1 4 0 0 -1 2级杀伤内力 2级杀伤内力
    data(4,56) = 1 1 4 0 0 -1 3级杀伤内力 3级杀伤内力
    data(4,57) = 1 1 4 0 0 -1 4级杀伤内力 4级杀伤内力
    data(4,58) = 1 1 4 0 0 -1 5级杀伤内力 5级杀伤内力
    data(4,59) = 1 1 4 0 0 -1 6级杀伤内力 6级杀伤内力
    data(4,60) = 1 1 4 0 0 -1 7级杀伤内力 7级杀伤内力
    data(4,61) = 1 1 4 0 0 -1 8级杀伤内力 8级杀伤内力
    data(4,62) = 1 1 4 0 0 -1 9级杀伤内力 9级杀伤内力
    data(4,63) = 1 1 4 0 0 -1 10级杀伤内力 10级杀伤内力
    data(4,64) = 1 1 40 1 1 -1 长名称 长名称

 
    TypeName5 =小宝商店
    TypedataItem5 = 15
    
    data(5,0) = 1 1 4 0 0 2 物品1 物品1
    data(5,1) = 1 1 4 0 0 2 物品2 物品2
    data(5,2) = 1 1 4 0 0 2 物品3 物品3
    data(5,3) = 1 1 4 0 0 2 物品4 物品4
    data(5,4) = 1 1 4 0 0 2 物品5 物品5
    data(5,5) = 1 1 4 0 0 -1 物品1数量 物品1数量
    data(5,6) = 1 1 4 0 0 -1 物品2数量 物品2数量
    data(5,7) = 1 1 4 0 0 -1 物品3数量 物品3数量
    data(5,8) = 1 1 4 0 0 -1 物品4数量 物品4数量
    data(5,9) = 1 1 4 0 0 -1 物品5数量 物品5数量
    data(5,10) = 1 1 4 0 0 -1 物品1价格 物品1价格
    data(5,11) = 1 1 4 0 0 -1 物品2价格 物品2价格
    data(5,12) = 1 1 4 0 0 -1 物品3价格 物品3价格
    data(5,13) = 1 1 4 0 0 -1 物品4价格 物品4价格
    data(5,14) = 1 1 4 0 0 -1 物品5价格 物品5价格


[KdefAttrib]
;保存每条指令的属性，请不要更改"
Number=80

Attrib0=0 1 0 0 0 空指令(清屏)
Attrib1=1 4 0 0 0 对话(对话编号,人物头像代号,对话框位置)
Attrib2=2 3 0 0 0 得到物品(物品编号,数量)
Attrib3=3 14 0 0 0 重新修改事件内容
Attrib4=4 4 1 2 3 使用物体触发事件(物品编号,正确转向偏移量,不正确转向偏移量)
Attrib5=5 3 1 1 2 询问是否战斗(是转向偏移量,否转向偏移量) 
Attrib6=6 5 1 2 3 战斗(战斗场景编号,赢转向偏移量,输转向偏移量,输后是否有经验值得)
Attrib7=7 1 0 0 0 无条件返回，事件结束
Attrib8=8 2 0 0 0 改变大地图音乐(0300)
Attrib9=9 3 1 1 2 询问是否加入(是转向偏移量,否转向偏移量)
Attrib10=a 2 0 0 0 加入队员(人物代号) 
Attrib11=b 3 1 1 2 询问是否住宿(是转向偏移量,否转向偏移量) 
Attrib12=c 1 0 0 0 住宿
Attrib13=d 1 0 0 0 场景重新显示
Attrib14=e 1 0 0 0 场景从明亮渐变为暗淡
Attrib15=f 2 0 0 0 死亡回到选单(5300)
Attrib16=10 4 1 2 3 判断某个人是否在队中(人代号,在转向偏移量,不在转向偏移量)
Attrib17=11 6 0 0 0 修改场景的s*贴图(场景编号,图层,横坐标,纵坐标,贴图编号)
Attrib18=12 4 1 2 3 判断是否有某种物品(物品编号,有转向偏移量,没有转向偏移量)
Attrib19=13 3 0 0 0 改变主角当前位置(目标x,目标y) 
Attrib20=14 3 1 1 2 判断队伍是否满(满转向偏移量,不满转向偏移量) 
Attrib21=15 2 0 0 0 队员离队(人代号) 
Attrib22=16 1 0 0 0 内力降为0 
Attrib23=17 3 0 0 0 设置用毒能力(人代号,数值)
Attrib24=18 1 0 0 0 死亡黒色背景
Attrib25=19 5 0 0 0 场景移动(原始x,原始y,目标x,目标y) 
Attrib26=1a 6 0 0 0 增加场景事件编号的三个触发事件编号
Attrib27=1b 4 0 0 0 显示动画(图1,图2,图3)
Attrib28=1c 6 1 4 5 判断品德(人代号,数值下限,数值上限,达到转向偏移量,否转向偏移量)
Attrib29=1d 6 1 4 5 判断武力(人代号,数值下限,数值上限,达到转向偏移量,否转向偏移量) 
Attrib30=1e 5 0 0 0 主角走动(原始x,原始y,目标x,目标y)
Attrib31=1f 4 1 2 3 判断是否够钱(需要钱数,够钱转向偏移量,不够转向偏移量)
Attrib32=20 3 0 0 0 增加物品数量(物品编号,数量) 
Attrib33=21 4 0 0 0 学会武功(人代号,武功编号,[0000显示学会什么武功]) 
Attrib34=22 3 0 0 0 增加资质(人代号,数值) 
Attrib35=23 5 0 0 0 设置武功(人代号,武功栏位,武功编号,武功点数)
Attrib36=24 4 1 2 3 判断主角的性别(主角的性别,是转向偏移量,否转向偏移量)
Attrib37=25 2 0 0 0 设置品德(数值) 
Attrib38=26 5 0 0 0 修改场景贴图(场景编号,图层编号,原有贴图,修改后贴图)
Attrib39=27 2 0 0 0 打开场景(场景编号)
Attrib40=28 2 0 0 0 主角面向何方(站立图编号) 
Attrib41=29 4 0 0 0 非我方队员增加物品(人代号,物品编号,数量) 
Attrib42=2a 3 1 1 2 判断队里是否有女性(是转向偏移量,否转向偏移量)
Attrib43=2b 4 1 2 3 判断物品栏里是否有指定物品(物品编号,有转向偏移量,无转向偏移量) 
Attrib44=2c 7 0 0 0 播放动画
Attrib45=2d 3 0 0 0 增加轻功(人代号,数值)
Attrib46=2e 3 0 0 0 增加内力(人代号,数值)
Attrib47=2f 3 0 0 0 增加武力(人代号,数值)
Attrib48=30 3 0 0 0 增加生命(人代号,数值)
Attrib49=31 3 0 0 0 设置内力属性(人代号,数值)
;    Attrib50=32 8 1 6 7 判断物品栏里是否有指定的5种物品
Attrib50=32 8 0 0 0 判断物品栏里是否有指定的5种物品
Attrib51=33 1 0 0 0 问软体娃娃
Attrib52=34 1 0 0 0 看道德
Attrib53=35 1 0 0 0 看声望
Attrib54=36 1 0 0 0 见过南贤后可以进入各场景
Attrib55=37 5 1 3 4 判断事件编号(事件编号,给定编号,是偏移,否偏移)
Attrib56=38 2 0 0 0 增加声望(数值)
Attrib57=39 1 0 0 0 主角在高昌迷宫砍石门的动画
Attrib58=3a 1 0 0 0 武道大会比武
Attrib59=3b 1 0 0 0 全部队员离队并找不到
Attrib60=3c 6 1 4 5 判断场景某层某图块？？？(？,？,某地一幅图块,是偏移,否偏移)
Attrib61=3d 3 1 1 2 判断是否放完14本书？(是偏移,否偏移) 
Attrib62=3e 7 0 0 0 播放进入时空机动画
Attrib63=3f 3 0 0 0 设置性别(人代号,数值)
Attrib64=40 1 0 0 0 韦小宝卖东西 
Attrib65=41 1 0 0 0 韦小宝去其它客栈
Attrib66=42 2 0 0 0 播放音乐(音乐编号) 
Attrib67=43 2 0 0 0 播放声音(声音编号)
Attrib68=44 8 0 0 0 新对话(头像号,对话号,显示名字,显示位置,是否显示头像,颜色)
Attrib69=45 4 0 0 0 对话替换字符
Attrib70=46 3 0 0 0 显示字幕(对话号，颜色)
Attrib71=47 4 0 0 0 场景跳转(场景编号，X，Y)
Attrib72=48 6 0 0 0 设置人物属性(人物编号,模式,加等级，最低，最高)

; 指令50的含义翻译
[kdef50]

    ; 最大指令个数
    num=50    

    Sub0=变量赋值
    Sub1=数组变量赋值
    Sub2=取数组变量值
    sub3=四则运算
    Sub4=变量判断
    SUB5=全部变量清零
    sub6=定义变量名
    SUb8=读对话到字符串
    Sub9=Sprintf
    Sub10=取字符串长度
    Sub11=字符串合并
    Sub12=空格字符串
    SUb16=保存属性
    SUb17=读取属性
    sub18=保存队伍
    sub19=读取队伍
    sub20=主角200个物品数量
    sub21=保存D*数据
    sub22=读取D*数据
    sub23=保存S*数据
    sub24=读取S*数据
    sub25=保存给定地址数据
    sub26=读取给定地址数据
    sub27=取属性名称
    sub28=取当前人物战斗序号
    sub29=选择攻击目标
    sub30=读取人物战斗属性
    sub31=保存人物战斗属性
    sub32=修改下一条指令
    sub33=显示字符串
    sub34=处理背景
    sub35=读取键盘
    sub36=显示字符串并等待击键
    sub37=延时
    sub38=随机数
    sub39=菜单选择
    sub40=滚动菜单选择
    sub41=显示图片
    sub42=改变主地图坐标
    sub43=调用其它事件
    sub44=播放效果
    sub45=显示数字  
    sub46=设定效果层
    sub47=重置战场贴图 
    sub48=调试指令，显示变量
    sub49=传说中的调用任意子程     
    sub50=输入名称 
    sub51=输入数量
    sub52=是否掌握武功
    sub53=增加属性
    Other=无

[W_Modify]
TypeDataItem=12
; 数组个数，数组结构成员个数，字节数，是否字串，是否名称，引用数据类型，名字，说明，是否地图号，标识类型，标识编号
; 间隔使用空格，一定要注意字符串中间不能有空格，而且空格只能有一个，等号后面不能有空格。
Data(0)=1 1 2 0 0 0 编号 地图编号 0 0 0
Data(1)=1 1 10 1 1 0 名称 地图名称 0 0 0
Data(2)=1 1 2 0 0 0 地图号 引用地图编号 1 0 0
Data(3)=1 1 2 0 0 0 经验 地图经验值 0 0 0
Data(4)=1 1 2 0 0 0 音乐 地图所用音乐 0 0 0
Data(5)=6 1 2 0 0 1 队友 参加的队友编号 0 0 5
Data(6)=6 1 2 0 0 1 自动队友 自动队友编号（不为空则读取自动队友） 0 0 7
Data(7)=6 1 2 0 0 0 队友X 队友X坐标 0 1 1
Data(8)=6 1 2 0 0 0 队友Y 队友Y坐标 0 1 2
Data(9)=20 1 2 0 0 1 敌人 敌人队友编号 0 0 6
Data(10)=20 1 2 0 0 0 敌人X 敌人X坐标 0 2 3
Data(11)=20 1 2 0 0 0 敌人Y 敌人Y坐标 0 2 4



[D_modify]
num=11
Attrib0=能否通过
Attrib1=编号
Attrib2=事件1
Attrib3=事件2
Attrib4=事件3
Attrib5=开始贴图
Attrib6=结束贴图
Attrib7=临时贴图
Attrib8=动画延迟
Attrib9=横坐标X
Attrib10=纵坐标Y

[50memory]
;50指令内存表
MemNum=14

Mem0=1C0B90 计秒，每3600/65536秒加1
Mem1=1C0B92 计时，计秒溢出则加1
Mem2=1C0BF8 当前主角贴图号
Mem3=544F2 当前主角面向
Mem4=1D295E 当前场景号
Mem5=1D295C 当前主角座标x
Mem6=1D295A 当前主角座标y
Mem7=1D2958 当前场景座标x
Mem8=1D2956 当前场景座标y
Mem9=1 战斗回合
Mem10=2 倒计时
Mem11=3 当钱事件
Mem12=4 战斗状态（0继续，1胜利，2失败）
Mem13=5 最大战斗人数
Mem14=6 自动刷新开关（0开，用于50指令显示图片、字符串）
